# ISI-DDBB-RISK

Este cuadernillo implementará la estructura del juego del RISK, en base de datos. Además esté cuadernillo pretende hacer visible el desarrollo paso a paso de la implementación, no solo necesaria para el juego, sino también para mantener un sistema de consultas de partidas de RISK.
Todos los diagramas E/R que vayan apareciendo son sucteptibles de sufrir cambios a lo largo del proceso.

In [41]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
%sql sqlite:///ISI-RISK.db

'Connected: None@ISI-RISK.db'

### TABLA JUGADORES

![Diagrama E/R](IMG/tabla_jugadores.JPG)

In [18]:
%%sql DROP TABLE jugadores;
CREATE TABLE jugadores(color VARCHAR(20),
                       nombre VARCHAR(20),
                       batallones FLOAT,
                       PRIMARY KEY(nombre));

Done.
Done.

[]

In [19]:
%%sql
INSERT INTO jugadores(color,nombre,batallones) VALUES('naranja','ana',3);
INSERT INTO jugadores(color,nombre,batallones) VALUES('verde','pepe',3);
INSERT INTO jugadores(color,nombre,batallones) VALUES('rojo','maria',3);
INSERT INTO jugadores(color,nombre,batallones) VALUES('azul','pablo',3);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [21]:
%%sql 
PRAGMA table_info(jugadores);

Done.

[(0, 'color', 'VARCHAR(20)', 0, None, 0),
 (1, 'nombre', 'VARCHAR(20)', 0, None, 1),
 (2, 'batallones', 'FLOAT', 0, None, 0)]

In [25]:
%sql SELECT * FROM jugadores;

Done.

[('naranja', 'ana', 3.0),
 ('verde', 'pepe', 3.0),
 ('rojo', 'maria', 3.0),
 ('azul', 'pablo', 3.0)]

### TABLA PAISES

![Diagrama E/R](IMG/tabla_paises.JPG)

In [35]:
%%sql
DROP TABLE paises;
CREATE TABLE paises(nombre VARCHAR(20),
                    fronteras VARCHAR(128),
                    PRIMARY KEY(nombre));

Done.
Done.

[]

In [36]:
%%sql
INSERT INTO paises(nombre,fronteras) VALUES('españaa','francia,portugal');
INSERT INTO paises(nombre,fronteras) VALUES('francia','españa,italia,alemania');
INSERT INTO paises(nombre,fronteras) VALUES('japon',NULL);
INSERT INTO paises(nombre,fronteras) VALUES('china','rusia');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [37]:
%sql PRAGMA table_info(paises);

Done.

[(0, 'nombre', 'VARCHAR(20)', 0, None, 1),
 (1, 'fronteras', 'VARCHAR(128)', 0, None, 0)]

In [38]:
%sql SELECT * FROM paises;

Done.

[('españaa', 'francia,portugal'),
 ('francia', 'españa,italia,alemania'),
 ('japon', None),
 ('china', 'rusia')]

### Relación entre las tablas de Jugadores y Paises

![Diagrama E/R](IMG/relacion_jugadores_paises.JPG)

In [43]:
%sql ALTER TABLE paises ADD COLUMN jugador VARCHAR(20);

Done.

[]

In [44]:
%sql PRAGMA table_info(paises);

Done.

[(0, 'nombre', 'VARCHAR(20)', 0, None, 1),
 (1, 'fronteras', 'VARCHAR(128)', 0, None, 0),
 (2, 'jugador', 'VARCHAR(20)', 0, None, 0)]

In [45]:
%sql SELECT * FROM paises;

Done.

[('españaa', 'francia,portugal', None),
 ('francia', 'españa,italia,alemania', None),
 ('japon', None, None),
 ('china', 'rusia', None)]

Añadimos ahora la entidad de partidas y como se relaciona con jugadores y paises.

### Tabla  Partidas

![Diagrama E/R](IMG/tabla_partidas.JPG)

In [55]:
%%sql
DROP TABLE partidas;
CREATE TABLE partidas(inicio DATETIME,
                      fin DATETIME,
                      ganador VARCHAR(20),
                      PRIMARY KEY(inicio,fin),
                      FOREIGN KEY (ganador) REFERENCES jugadores(nombre));

Done.
Done.

[]

In [56]:
%%sql
INSERT INTO partidas(inicio,fin) VALUES('03/12/2016','03/12/2016');
INSERT INTO partidas(inicio,fin) VALUES('09/12/2016','09/12/2016');
INSERT INTO partidas(inicio,fin) VALUES('13/12/2016','13/12/2016');
INSERT INTO partidas(inicio,fin) VALUES('23/12/2016','23/12/2016');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [57]:
%sql PRAGMA table_info(partidas);

Done.

[(0, 'inicio', 'DATETIME', 0, None, 1),
 (1, 'fin', 'DATETIME', 0, None, 2),
 (2, 'ganador', 'VARCHAR(20)', 0, None, 0)]

In [58]:
%sql SELECT * FROM partidas;

Done.

[('03/12/2016', '03/12/2016', None),
 ('09/12/2016', '09/12/2016', None),
 ('13/12/2016', '13/12/2016', None),
 ('23/12/2016', '23/12/2016', None)]

### Relación entre las tablas de partidas con paises y jugadores

![Diagrama E/R](IMG/relacion_partidas_jugadores_paises.JPG)

In [60]:
%%sql
DROP TABLE partida_tiene;
CREATE TABLE partida_tiene(inicio DATETIME,
                           fin DATETIME,
                           jugadores VARCHAR(20),
                           paises VARCHAR(20));

Done.
Done.

[]